arthurlobo.easy-codesnap
astro-build.astro-vscode
bierner.emojisense
bradlc.vscode-tailwindcss
codezombiech.gitignore
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
edwinhuish.better-comments-next
jeanp413.open-remote-ssh
jeff-hykin.better-cpp-syntax
johnpapa.vscode-peacock
kisstkondoros.vscode-gutter-preview
llvm-vs-code-extensions.vscode-clangd
mesonbuild.mesonbuild
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.makefile-tools
pkief.material-icon-theme
pkief.material-product-icons
redhat.vscode-xml
redhat.vscode-yaml
saoudrizwan.claude-dev
tauri-apps.tauri-vscode
ultram4rine.vscode-choosealicense
usernamehw.errorlens
vscodevim.vim
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
